<?php

return [
    /*
    |--------------------------------------------------------------------------
    | PDO 类型
    |--------------------------------------------------------------------------
    | 默认情况下 Laravel 的数据库是用 PDO 来操作的，这样能极大化的提高数据库兼容性。
    | 那么默认查询返回的类型是一个对象，也就是如下的默认设置。
    | 如果你需要返回的是一个数组，你可以设置成 'PDO::FETCH_ASSOC'
    */
    'fetch' => PDO::FETCH_CLASS,
    /*
    |--------------------------------------------------------------------------
    | 默认的数据库连接名
    |--------------------------------------------------------------------------
    | 这里所说的名字是和下面的 'connections' 中的名称对应的，而不是指你用的什么数据库
    |
    */
    'default' => 'general_db',
    /*
    |--------------------------------------------------------------------------
    | 数据库连接名
    |--------------------------------------------------------------------------
    | 这里就是设置各种数据库的配置的，每个数组里的 'driver' 表明了你要用的数据库类型
    | 同一种数据库类型可以设置多种配置，名字区分开就行，就像下面的 'statistic' 和 'statistic.admin'
    |
    */
    'connections' => [
        'magpie' => [
            'host' => env('DB_HOST'),
            'port' => env('DB_PORT'),
            'database' => env('DB_DATABASE'),
            'username' => env('DB_USERNAME'),
            'password' => env('DB_PASSWORD'),
            'driver' => 'mysql',
            'charset' => 'utf8mb4',
            'collation' => 'utf8mb4_general_ci',
            'prefix' => '',
        ],
    ],
    /*
    |--------------------------------------------------------------------------
    | Redis 配置
    |--------------------------------------------------------------------------
    |
    */
    'redis' => [
        'cluster' => false,
        //主站Redis
        'default' => [
            'host' => '127.0.0.1',
            'password' => 'TqWhCdNx0Zg1t#ya',
            'port' => 6379,
        ],
    ]
];
